/*
Дано натуральное число N. Выведите все его цифры по одной, в прямом
порядке, разделяя их пробелами или новыми строками. Необходимо
реализовать рекурсивную функцию.
void print_num(int num)
Данные на входе: Одно целое неотрицательное число
Данные на выходе: Все цифры числа через пробел в прямом порядке.
*/

#include <stdio.h>

void print_num(int);

int main(void)
{
	int a;
	printf("Введите натуральное число: ");
	scanf("%d", &a);
	
	print_num(a);

	return 0;
}

void print_num(int num)
{
	if(num > 9)
		print_num(num / 10);
		
	printf("%d ",num % 10);
}
